astb_relise/src/Documents/РемонтСредствЗащиты/РемонтСредствЗащиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РемонтСредствЗащиты</name>
  <basedOn>Document.РемонтСредствЗащиты</basedOn>
  <registerRecords>AccumulationRegister.РемонтСредствЗащиты</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодИзделия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРемонтаСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РемонтСредствЗащиты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РемонтуНеПодлежит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ремонт</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.ВидыРемонтаСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/InformationRegisters/ШтрихкодыНоменклатурыДляУчетаЧистки/ШтрихкодыНоменклатурыДляУчетаЧистки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатурыДляУчетаЧистки</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>МВЗ</name>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/Enums/ВидыОперацийРемонтаСИЗ/ВидыОперацийРемонтаСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРемонтаСИЗ</name>
  <enumValues>
    <name>ПередачаВРемонт</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзРемонта</name>
  </enumValues>
  <enumValues>
    <name>Ремонт</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <comment>Номенклатура для выдачи</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСинхронизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАнтропометрическогоСвойства</name>
    <type>
      <types>CatalogRef.ВидыАнтропометрическихСвойств</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьВидАнтропометрическогоСвойстваПриАнализе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРост</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСИЗ</name>
    <type>
      <types>CatalogRef.ВидыСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесДляУчетаЧистки</name>
    <comment>Вес для учета чистки (химчистки) СИЗ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьКакКомплектВЗаказеПоставщикуИОтчетеДляСАП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьШтрихкод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоеКоличествоЦикловЧистки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРазмеровМеньше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРазмеровБольше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможнаАвтоматизированнаяВыдача</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматизированнаяВыдачаБезОшибок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьПриФормированииЗаказовПоставщику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриниматьНаХранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСбыта</name>
    <type>
      <types>EnumRef.СтатусыСбыта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУчетаКомплектаДляППС</name>
    <type>
      <types>EnumRef.ВидыУчетаКомплектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаркированнойНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыМаркированнойНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаХранения</name>
    <type>
      <types>CatalogRef.ТочкиХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодлежитУтилизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НавигационнаяСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рейтинг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяДляПримеркиВTexel</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРоста</name>
    <type>
      <types>CatalogRef.ВидыАнтропометрическихСвойств</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГОСТы</name>
    <attributes>
      <name>ГОСТ</name>
      <type>
        <types>CatalogRef.ГОСТы</types>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сертификаты</name>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

astb_relise/src/Catalogs/ВидыРемонтаСИЗ/ВидыРемонтаСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРемонтаСИЗ</name>
  <predefined>
    <items>
      <name>РемонтуНеПодлежит</name>
      <description>Ремонту не подлежит</description>
    </items>
  </predefined>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

astb_relise/src/Documents/РемонтСредствЗащиты/Forms/ФормаДокумента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) И НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Объект.ДокументОснование.РемонтуНеПодлежит Тогда
			Отказ = Истина;
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "У документа-основания изделие ремноту не подлежит!.";
			СообщениеПользователю.Сообщить();
			Возврат;
		КонецЕсли;
		
		Если НЕ Объект.ДокументОснование.ВидОперации = Перечисления.ВидыОперацийРемонтаСИЗ.ПередачаВРемонт Тогда
			Отказ = Истина;
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Допускается ввод на основании документа с видом операции <<Передача в ремонт>>.";
			СообщениеПользователю.Сообщить();
			Возврат;
		КонецЕсли;
		
	КонецЕсли;	
	
	// ПодключаемоеОборудование
	ПроцедурыРаботыСНормамиСервер.НастроитьПодключаемоеОборудование(ЭтаФорма);
	// Конец ПодключаемоеОборудование
	
	// СтандартныеПодсистемы.Свойства
 	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект,НОВЫЙ Структура("ИмяЭлементаДляРазмещения","ГруппаДополнительныеРеквизиты"));
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.Печать
	
	УстановитьВидимость();
	УстановитьДоступность();
	
	ЗаполнитьИнформациюПоШтрихкодуИзделия();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	Если ИспользоватьПодключаемоеОборудование Тогда
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", ЭтотОбъект);    
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(ОповещенияПриПодключении, УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	Если ИспользоватьПодключаемоеОборудование Тогда
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		ОповещенияПриОтключении = Новый ОписаниеОповещения("ОтключитьОборудованиеЗавершение", ЭтотОбъект);    
		МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(ОповещенияПриОтключении, УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
 	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПроцедурыРаботыСНормамиКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "СВОЙСТВА"

// СтандартныеПодсистемы.Свойства
 &НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "ПЕЧАТЬ"

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
  	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
  
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ...

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При подключении оборудования произошла ошибка:
				|""%ОписаниеОшибки%"".'" );
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При отключении оборудования произошла ошибка: ""%ОписаниеОшибки%"".'" );
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьДокументРемонта()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РемонтСредствЗащиты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РемонтСредствЗащиты КАК РемонтСредствЗащиты
	|ГДЕ
	|	РемонтСредствЗащиты.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование",Объект.Ссылка);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции	

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.ДокументОснование.Видимость	= ЗначениеЗаполнено(Объект.ДокументОснование);	
	Элементы.ВидОперации.Видимость 			= НЕ ЗначениеЗаполнено(Объект.ДокументОснование);
	Элементы.ВидОперацииВозврат.Видимость 	= ЗначениеЗаполнено(Объект.ДокументОснование); 	
	Элементы.ГруппаРемонт.Видимость			= НЕ Объект.РемонтуНеПодлежит;
	Элементы.ГруппаПредупреждение.Видимость = ЕстьДокументРемонта();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность()
	
	Элементы.Организация.ТолькоПросмотр 		= ЗначениеЗаполнено(Объект.ДокументОснование) ИЛИ ЕстьДокументРемонта();
	Элементы.Контрагент.ТолькоПросмотр 			= ЗначениеЗаполнено(Объект.ДокументОснование) ИЛИ ЕстьДокументРемонта();
	Элементы.ШтрихкодИзделия.ТолькоПросмотр 	= ЗначениеЗаполнено(Объект.ДокументОснование) ИЛИ ЕстьДокументРемонта();
	Элементы.РемонтуНеПодлежит.ТолькоПросмотр 	= ЗначениеЗаполнено(Объект.ДокументОснование) ИЛИ ЕстьДокументРемонта();
	Элементы.Комментарий.ТолькоПросмотр 		= ЗначениеЗаполнено(Объект.ДокументОснование) ИЛИ ЕстьДокументРемонта();
	Элементы.Ответственный.ТолькоПросмотр 		= ЗначениеЗаполнено(Объект.ДокументОснование) ИЛИ ЕстьДокументРемонта();
	Элементы.Ремонт.ТолькоПросмотр 				= ЗначениеЗаполнено(Объект.ДокументОснование) ИЛИ ЕстьДокументРемонта();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов)
	
	ТекущийШтрихкод = СтрЗаменить(ДанныеШтрихкодов[0].Штрихкод,Символ(29)," ");
	ТекущийШтрихкод = СтрЗаменить(ТекущийШтрихкод,Символ(19)," ");
	
	Объект.ШтрихкодИзделия = ТекущийШтрихкод;
	
	ЗаполнитьИнформациюПоШтрихкодуИзделия();
	
	Модифицированность = Истина;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьИнформациюПоШтрихкодуИзделия()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Организация КАК ОрганизацияИзделия,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Сотрудник КАК Сотрудник,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.ДатаВыдачи КАК ДатаВыдачи
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатурыДляУчетаЧистки КАК ШтрихкодыНоменклатурыДляУчетаЧистки
	|ГДЕ
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод",Объект.ШтрихкодИзделия);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		ОрганизацияИзделия 			= Справочники.Организации.ПустаяСсылка();
		Сотрудник 					= Справочники.Сотрудники.ПустаяСсылка();
		Номенклатура 				= Справочники.Номенклатура.ПустаяСсылка();
		ХарактеристикаНоменклатуры 	= Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		ДатаВыдачи 					= Дата(1,1,1,0,0,0);
	Иначе
		ОрганизацияИзделия 			= Результат.Выгрузить()[0].ОрганизацияИзделия;
		Сотрудник 					= Результат.Выгрузить()[0].Сотрудник;
		Номенклатура 				= Результат.Выгрузить()[0].Номенклатура;
		ХарактеристикаНоменклатуры 	= Результат.Выгрузить()[0].ХарактеристикаНоменклатуры;
		ДатаВыдачи 					= Результат.Выгрузить()[0].ДатаВыдачи;
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ШтрихкодИзделияПриИзменении(Элемент)
	
	ЗаполнитьИнформациюПоШтрихкодуИзделия();
	
КонецПроцедуры

&НаКлиенте
Процедура РемонтВидРемонтаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Ремонт.ТекущиеДанные;
	
	Если ТекущиеДанные.ВидРемонта = ПредопределенноеЗначение("Справочник.ВидыРемонтаСИЗ.РемонтуНеПодлежит") Тогда
		ТекущиеДанные.ВидРемонта = ПредопределенноеЗначение("Справочник.ВидыРемонтаСИЗ.ПустаяСсылка");
		Возврат;
	КонецЕсли;	
	
	Если ТекущиеДанные.Количество = 0 Тогда
		ТекущиеДанные.Количество = 1;
	КонецЕсли;	
	
	ТекущиеДанные.Цена 	= ПолучитьЦенуВидаРемонтаНаСервере(ТекущиеДанные.ВидРемонта);
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуВидаРемонтаНаСервере(ВидРемонта)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	Возврат Документы.РемонтСредствЗащиты.ПолучитьЦенуВидаРемонта(ВидРемонта,ТекущийОбъект);
	
КонецФункции	

&НаКлиенте
Процедура РемонтКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Ремонт.ТекущиеДанные;
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	
КонецПроцедуры

&НаСервере
Процедура РемонтуНеПодлежитПриИзмененииНаСервере()
	
	Объект.Ремонт.Очистить();
	
	Если Объект.РемонтуНеПодлежит  Тогда
		НоваяСтрока = Объект.Ремонт.Добавить();
		НоваяСтрока.ВидРемонта = Справочники.ВидыРемонтаСИЗ.РемонтуНеПодлежит;
		НоваяСтрока.Количество = 1;
	КонецЕсли;
	
	Объект.СуммаДокумента = 0;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура РемонтуНеПодлежитПриИзменении(Элемент)
	
	РемонтуНеПодлежитПриИзмененииНаСервере();
	
КонецПроцедуры
